raiden00pl/nuttx/arch/arm/src/nrf54l/hardware/nrf54l_usbd.h
#define NRF54L_USBD_DIEPTSIZ_OFFSET(n)  (0x910 + ((n) << 5))  /* Device IN endpoint n transfer size */

#define NRF54L_USBD_DTXFSTS_OFFSET(n)   (0x0918 + ((n) << 5)) /* Device IN endpoint n transmit FIFO status */

#define NRF54L_USBD_DOEP_OFFSET(n)      (0x0b00 + ((n) << 5)) /* Device OUT endpoint n register block */
#define NRF54L_USBD_DOEPCTL_EPOFFSET    0x0000                /* Device control OUT endpoint 0 control register */
#define NRF54L_USBD_DOEPINT_EPOFFSET    0x0008                /* Device endpoint-x interrupt register */

#define NRF54L_USBD_DOEPCTL_OFFSET(n)   (0x0b00 + ((n) << 5)) /* Device OUT endpoint n control */

#define NRF54L_USBD_DOEPINT_OFFSET(n)   (0x0b08 + ((n) << 5)) /* Device OUT endpoint n interrupt status */

#define NRF54L_USBD_DOEPTSIZ_OFFSET(n)  (0x0b10 + ((n) << 5)) /* Device OUT endpoint n transfer size */

/* Power and clock gating registers */

#define NRF54L_USBD_PCGCCTL_OFFSET      0x0e00 /* Power and clock gating control register */

/* Data FIFO (DFIFO) access registers */

#define NRF54L_USBD_DFIFO_DEP_OFFSET(n) (0x1000 + ((n) << 12)) /* Device endpoint n FIFO access */
#define NRF54L_USBD_DFIFO_HCH_OFFSET(n) (0x1000 + ((n) << 12)) /* Host channel n FIFO access */

/* Register Addresses *******************************************************/

#define NRF54L_USBD_GOTGCTL             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GOTGCTL_OFFSET)
#define NRF54L_USBD_GOTGINT             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GOTGINT_OFFSET)
#define NRF54L_USBD_GAHBCFG             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GAHBCFG_OFFSET)
#define NRF54L_USBD_GUSBCFG             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GUSBCFG_OFFSET)
#define NRF54L_USBD_GRSTCTL             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GRSTCTL_OFFSET)
#define NRF54L_USBD_GINTSTS             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GINTSTS_OFFSET)
#define NRF54L_USBD_GINTMSK             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GINTMSK_OFFSET)
#define NRF54L_USBD_GRXSTSR             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GRXSTSR_OFFSET)
#define NRF54L_USBD_GRXSTSP             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GRXSTSP_OFFSET)
#define NRF54L_USBD_GRXFSIZ             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GRXFSIZ_OFFSET)
#define NRF54L_USBD_HNPTXFSIZ           (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HNPTXFSIZ_OFFSET)
#define NRF54L_USBD_DIEPTXF0            (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DIEPTXF0_OFFSET)
#define NRF54L_USBD_HNPTXSTS            (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HNPTXSTS_OFFSET)
#define NRF54L_USBD_GGPIO               (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GGPIO_OFFSET)
#define NRF54L_USBD_GUID                (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GUID_OFFSET)
#define NRF54L_USBD_GSNPSID             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GSNPSID_OFFSET)
#define NRF54L_USBD_GHWCFG1             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GHWCFG1_OFFSET)
#define NRF54L_USBD_GHWCFG2             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GHWCFG2_OFFSET)
#define NRF54L_USBD_GHWCFG3             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GHWCFG3_OFFSET)
#define NRF54L_USBD_GHWCFG4             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_GHWCFG4_OFFSET)
#define NRF54L_USBD_HPTXFSIZ            (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HPTXFSIZ_OFFSET)

#define NRF54L_USBD_DIEPTXF(n)          (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DIEPTXF_OFFSET(n))

/* Host-mode control and status registers */

#define NRF54L_USBD_HCFG                (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HCFG_OFFSET)
#define NRF54L_USBD_HFIR                (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HFIR_OFFSET)
#define NRF54L_USBD_HFNUM               (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HFNUM_OFFSET)
#define NRF54L_USBD_HPTXSTS             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HPTXSTS_OFFSET)
#define NRF54L_USBD_HAINT               (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HAINT_OFFSET)
#define NRF54L_USBD_HAINTMSK            (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HAINTMSK_OFFSET)
#define NRF54L_USBD_HPRT                (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HPRT_OFFSET)

#define NRF54L_USBD_CHAN(n)             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_CHAN_OFFSET(n))

#define NRF54L_USBD_HCCHAR(n)           (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HCCHAR_OFFSET(n))

#define NRF54L_USBD_HCINT(n)            (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HCINT_OFFSET(n))

#define NRF54L_USBD_HCINTMSK(n)         (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HCINTMSK_OFFSET(n))

#define NRF54L_USBD_HCTSIZ(n)           (NRF54L_USBHSCORE_BASE+NRF54L_USBD_HCTSIZ_OFFSET(n))

/* Device-mode control and status registers */

#define NRF54L_USBD_DCFG                (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DCFG_OFFSET)
#define NRF54L_USBD_DCTL                (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DCTL_OFFSET)
#define NRF54L_USBD_DSTS                (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DSTS_OFFSET)
#define NRF54L_USBD_DIEPMSK             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DIEPMSK_OFFSET)
#define NRF54L_USBD_DOEPMSK             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DOEPMSK_OFFSET)
#define NRF54L_USBD_DAINT               (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DAINT_OFFSET)
#define NRF54L_USBD_DAINTMSK            (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DAINTMSK_OFFSET)
#define NRF54L_USBD_DVBUSDIS            (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DVBUSDIS_OFFSET)
#define NRF54L_USBD_DVBUSPULSE          (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DVBUSPULSE_OFFSET)
#define NRF54L_USBD_DIEPEMPMSK          (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DIEPEMPMSK_OFFSET)

#define NRF54L_USBD_DIEP(n)             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DIEP_OFFSET(n))

#define NRF54L_USBD_DIEPCTL(n)          (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DIEPCTL_OFFSET(n))

#define NRF54L_USBD_DIEPINT(n)          (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DIEPINT_OFFSET(n))

#define NRF54L_USBD_DIEPTSIZ(n)         (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DIEPTSIZ_OFFSET(n))

#define NRF54L_USBD_DTXFSTS(n)          (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DTXFSTS_OFFSET(n))

#define NRF54L_USBD_DOEP(n)             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DOEP_OFFSET(n))

#define NRF54L_USBD_DOEPCTL(n)          (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DOEPCTL_OFFSET(n))

#define NRF54L_USBD_DOEPINT(n)          (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DOEPINT_OFFSET(n))

#define NRF54L_USBD_DOEPTSIZ(n)         (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DOEPTSIZ_OFFSET(n))

/* Power and clock gating registers */

#define NRF54L_USBD_PCGCCTL             (NRF54L_USBHSCORE_BASE+NRF54L_USBD_PCGCCTL_OFFSET)

/* Data FIFO (DFIFO) access registers */

#define NRF54L_USBD_DFIFO_DEP(n)        (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DFIFO_DEP_OFFSET(n))
#define NRF54L_USBD_DFIFO_HCH(n)        (NRF54L_USBHSCORE_BASE+NRF54L_USBD_DFIFO_HCH_OFFSET(n))

/* Register Bitfield Definitions ********************************************/

/* Core global control and status registers */

/* Control and status register */

#define OTG_GOTGCTL_SRQSCS            (1 << 0)  /* Bit 0:  Session request success */
#define OTG_GOTGCTL_SRQ               (1 << 1)  /* Bit 1:  Session request */
#define OTG_GOTGCTL_VBVALOEN          (1 << 2)  /* Bit 2:  VBUS valid override enable */
#define OTG_GOTGCTL_VBVALOVAL         (1 << 3)  /* Bit 3:  VBUS valid override value */
#define OTG_GOTGCTL_AVALOEN           (1 << 4)  /* Bit 4:  A-peripheral session valid override enable */
#define OTG_GOTGCTL_AVALOVAL          (1 << 5)  /* Bit 5:  A-peripheral session valid override value */
#define OTG_GOTGCTL_BVALOEN           (1 << 6)  /* Bit 6:  B-peripheral session valid override enable */
#define OTG_GOTGCTL_BVALOVAL          (1 << 7)  /* Bit 7:  B-peripheral session valid override value  */
#define OTG_GOTGCTL_HNGSCS            (1 << 8)  /* Bit 8:  Host negotiation success */
#define OTG_GOTGCTL_HNPRQ             (1 << 9)  /* Bit 9:  HNP request */
#define OTG_GOTGCTL_HSHNPEN           (1 << 10) /* Bit 10: host set HNP enable */
#define OTG_GOTGCTL_DHNPEN            (1 << 11) /* Bit 11: Device HNP enabled */
#define OTG_GOTGCTL_EHEN              (1 << 12) /* Bit 12: Embedded host enable */
                                                /* Bits 13-15: Reserved */
#define OTG_GOTGCTL_CIDSTS            (1 << 16) /* Bit 16: Connector ID status */
#define OTG_GOTGCTL_DBCT              (1 << 17) /* Bit 17: Long/short debounce time */
#define OTG_GOTGCTL_ASVLD             (1 << 18) /* Bit 18: A-session valid */
#define OTG_GOTGCTL_BSVLD             (1 << 19) /* Bit 19: B-session valid */
#define OTG_GOTGCTL_OTGVER            (1 << 20) /* Bit 20: OTG version */
                                                /* Bits 21-31: Reserved */

