raiden00pl/nuttx/arch/arm/src/nrf54l/hardware/nrf54l_usbd.h
#define OTG_HCFG_FSLSPCS_SHIFT        (0)                           /* Bits 0-1: FS/LS PHY clock select */
#define OTG_HCFG_FSLSPCS_MASK         (3 << OTG_HCFG_FSLSPCS_SHIFT)
#  define OTG_HCFG_FSLSPCS_FS48MHz    (1 << OTG_HCFG_FSLSPCS_SHIFT) /* FS host mode, PHY clock is running at 48 MHz */
#  define OTG_HCFG_FSLSPCS_LS48MHz    (1 << OTG_HCFG_FSLSPCS_SHIFT) /* LS host mode,  Select 48 MHz PHY clock frequency */
#  define OTG_HCFG_FSLSPCS_LS6MHz     (2 << OTG_HCFG_FSLSPCS_SHIFT) /* LS host mode, Select 6 MHz PHY clock frequency */
#define OTG_HCFG_FSLSS                (1 << 2)                      /* Bit 2: FS- and LS-only support */
                                                                    /* Bits 31:3 Reserved */

/* Host frame interval register */

#define OTG_HFIR_SHIFT                (0)       /* Bits 0-16: Frame interval */
#define OTG_HFIR_MASK                 (0xffff << OTG_HFIR_SHIFT)
#define OTG_HFIR_RLDCTRL              (1 << 16) /* Bit 16: Reload control */
                                                /* Bits 17-31: Reserved */

/* Host frame number/frame time remaining register */

#define OTG_HFNUM_FRNUM_SHIFT         (0)       /* Bits 0-15: Frame number */
#define OTG_HFNUM_FRNUM_MASK          (0xffff << OTG_HFNUM_FRNUM_SHIFT)
#define OTG_HFNUM_FTREM_SHIFT         (16)      /* Bits 16-31: Frame time remaining */
#define OTG_HFNUM_FTREM_MASK          (0xffff << OTG_HFNUM_FTREM_SHIFT)

/* Host periodic transmit FIFO/queue status register */

#define OTG_HPTXSTS_PTXFSAVL_SHIFT    (0)                           /* Bits 0-15: Periodic transmit data FIFO space available */
#define OTG_HPTXSTS_PTXFSAVL_MASK     (0xffff << OTG_HPTXSTS_PTXFSAVL_SHIFT)
#  define OTG_HPTXSTS_PTXFSAVL_FULL   (0 << OTG_HPTXSTS_PTXFSAVL_SHIFT)
#define OTG_HPTXSTS_PTXQSAV_SHIFT     (16)                          /* Bits 16-23: Periodic transmit request queue space available */
#define OTG_HPTXSTS_PTXQSAV_MASK      (0xff << OTG_HPTXSTS_PTXQSAV_SHIFT)
#  define OTG_HPTXSTS_PTXQSAV_FULL    (0 << OTG_HPTXSTS_PTXQSAV_SHIFT)
#define OTG_HPTXSTS_PTXQTOP_SHIFT     (24)                          /* Bits 24-31: Top of the periodic transmit request queue */
#define OTG_HPTXSTS_PTXQTOP_MASK      (0xff << OTG_HPTXSTS_PTXQTOP_SHIFT)
#  define OTG_HPTXSTS_TERMINATE       (1 << 24)                     /* Bit 24: Terminate (last entry for selected channel/endpoint) */
#  define OTG_HPTXSTS_TYPE_SHIFT      (25)                          /* Bits 25-26: Type */
#  define OTG_HPTXSTS_TYPE_MASK       (3 << OTG_HPTXSTS_TYPE_SHIFT)
#    define OTG_HPTXSTS_TYPE_INOUT    (0 << OTG_HPTXSTS_TYPE_SHIFT) /* IN/OUT token */
#    define OTG_HPTXSTS_TYPE_ZLP      (1 << OTG_HPTXSTS_TYPE_SHIFT) /* Zero-length transmit packet */
#    define OTG_HPTXSTS_TYPE_HALT     (3 << OTG_HPTXSTS_TYPE_SHIFT) /* Disable channel command */
#  define OTG_HPTXSTS_EPNUM_SHIFT     (27)                          /* Bits 27-30: Endpoint number */
#  define OTG_HPTXSTS_EPNUM_MASK      (15 << OTG_HPTXSTS_EPNUM_SHIFT)
#  define OTG_HPTXSTS_CHNUM_SHIFT     (27)                          /* Bits 27-30: Channel number */
#  define OTG_HPTXSTS_CHNUM_MASK      (15 << OTG_HPTXSTS_CHNUM_SHIFT)
#  define OTG_HPTXSTS_ODD             (1 << 31)                     /* Bit 31: Send in odd (vs even) frame */

/* Host all channels interrupt and all channels interrupt mask registers */

#define OTG_HAINT(n)                  (1 << (n)) /* Bits 15:0 HAINTM: Channel interrupt */

/* Host port control and status register */

#define OTG_HPRT_PCSTS                (1 << 0)                    /* Bit 0:  Port connect status */
#define OTG_HPRT_PCDET                (1 << 1)                    /* Bit 1:  Port connect detected */
#define OTG_HPRT_PENA                 (1 << 2)                    /* Bit 2:  Port enable */
#define OTG_HPRT_PENCHNG              (1 << 3)                    /* Bit 3:  Port enable/disable change */
#define OTG_HPRT_POCA                 (1 << 4)                    /* Bit 4:  Port overcurrent active */
#define OTG_HPRT_POCCHNG              (1 << 5)                    /* Bit 5:  Port overcurrent change */
#define OTG_HPRT_PRES                 (1 << 6)                    /* Bit 6:  Port resume */
#define OTG_HPRT_PSUSP                (1 << 7)                    /* Bit 7:  Port suspend */
#define OTG_HPRT_PRST                 (1 << 8)                    /* Bit 8:  Port reset */
                                                                  /* Bit 9:  Reserved */
#define OTG_HPRT_PLSTS_SHIFT          (10)                        /* Bits 10-11: Port line status */
#define OTG_HPRT_PLSTS_MASK           (3 << OTG_HPRT_PLSTS_SHIFT)
#  define OTG_HPRT_PLSTS_DP           (1 << 10)                   /* Bit 10: Logic level of OTG_FS_FS_DP */
#  define OTG_HPRT_PLSTS_DM           (1 << 11)                   /* Bit 11: Logic level of OTG_FS_FS_DM */
#define OTG_HPRT_PPWR                 (1 << 12)                   /* Bit 12: Port power */
#define OTG_HPRT_PTCTL_SHIFT          (13)                        /* Bits 13-16: Port test control */
#define OTG_HPRT_PTCTL_MASK           (15 << OTG_HPRT_PTCTL_SHIFT)
#  define OTG_HPRT_PTCTL_DISABLED     (0 << OTG_HPRT_PTCTL_SHIFT) /* Test mode disabled */
#  define OTG_HPRT_PTCTL_J            (1 << OTG_HPRT_PTCTL_SHIFT) /* Test_J mode */
#  define OTG_HPRT_PTCTL_L            (2 << OTG_HPRT_PTCTL_SHIFT) /* Test_K mode */
#  define OTG_HPRT_PTCTL_SE0_NAK      (3 << OTG_HPRT_PTCTL_SHIFT) /* Test_SE0_NAK mode */
#  define OTG_HPRT_PTCTL_PACKET       (4 << OTG_HPRT_PTCTL_SHIFT) /* Test_Packet mode */
#  define OTG_HPRT_PTCTL_FORCE        (5 << OTG_HPRT_PTCTL_SHIFT) /* Test_Force_Enable */
#define OTG_HPRT_PSPD_SHIFT           (17)                        /* Bits 17-18: Port speed */
#define OTG_HPRT_PSPD_MASK            (3 << OTG_HPRT_PSPD_SHIFT)
#  define OTG_HPRT_PSPD_HS            (0 << OTG_HPRT_PSPD_SHIFT)  /* High speed */
#  define OTG_HPRT_PSPD_FS            (1 << OTG_HPRT_PSPD_SHIFT)  /* Full speed */
#  define OTG_HPRT_PSPD_LS            (2 << OTG_HPRT_PSPD_SHIFT)  /* Low speed */
                                                                  /* Bits 19-31: Reserved */

/* Host channel-n characteristics register */

#define OTG_HCCHAR_MPSIZ_SHIFT        (0)                           /* Bits 0-10: Maximum packet size */
#define OTG_HCCHAR_MPSIZ_MASK         (0x7ff << OTG_HCCHAR_MPSIZ_SHIFT)
#define OTG_HCCHAR_EPNUM_SHIFT        (11)                          /* Bits 11-14: Endpoint number */
#define OTG_HCCHAR_EPNUM_MASK         (15 << OTG_HCCHAR_EPNUM_SHIFT)
#define OTG_HCCHAR_EPDIR              (1 << 15)                     /* Bit 15: Endpoint direction */
#  define OTG_HCCHAR_EPDIR_OUT        (0)
#  define OTG_HCCHAR_EPDIR_IN         OTG_HCCHAR_EPDIR
                                                                    /* Bit 16 Reserved */
#define OTG_HCCHAR_LSDEV              (1 << 17)                     /* Bit 17: Low-speed device */
#define OTG_HCCHAR_EPTYP_SHIFT        (18)                          /* Bits 18-19: Endpoint type */
#define OTG_HCCHAR_EPTYP_MASK         (3 << OTG_HCCHAR_EPTYP_SHIFT)
#  define OTG_HCCHAR_EPTYP_CTRL       (0 << OTG_HCCHAR_EPTYP_SHIFT) /* Control */
#  define OTG_HCCHAR_EPTYP_ISOC       (1 << OTG_HCCHAR_EPTYP_SHIFT) /* Isochronous */
#  define OTG_HCCHAR_EPTYP_BULK       (2 << OTG_HCCHAR_EPTYP_SHIFT) /* Bulk */
#  define OTG_HCCHAR_EPTYP_INTR       (3 << OTG_HCCHAR_EPTYP_SHIFT) /* Interrupt */
#define OTG_HCCHAR_MCNT_SHIFT         (20)                          /* Bits 20-21: Multicount */
#define OTG_HCCHAR_MCNT_MASK          (3 << OTG_HCCHAR_MCNT_SHIFT)
#define OTG_HCCHAR_DAD_SHIFT          (22)                          /* Bits 22-28: Device address */
#define OTG_HCCHAR_DAD_MASK           (0x7f << OTG_HCCHAR_DAD_SHIFT)
#define OTG_HCCHAR_ODDFRM             (1 << 29)                     /* Bit 29: Odd frame */
#define OTG_HCCHAR_CHDIS              (1 << 30)                     /* Bit 30: Channel disable */
#define OTG_HCCHAR_CHENA              (1 << 31)                     /* Bit 31: Channel enable */

/* TODO: OTG host channel-n split control register */

/* Host channel-n interrupt and Host channel-0 interrupt mask registers */

