raiden00pl/nuttx/arch/arm/src/nrf54l/hardware/nrf54l_usbd.h
#define OTG_HCINT_XFRC                (1 << 0)  /* Bit 0: Transfer completed */
#define OTG_HCINT_CHH                 (1 << 1)  /* Bit 1: Channel halted */
#define OTG_HCINT_AHBERR              (1 << 2)  /* Bit 2: AHB error */
#define OTG_HCINT_STALL               (1 << 3)  /* Bit 3: STALL response received interrupt */
#define OTG_HCINT_NAK                 (1 << 4)  /* Bit 4: NAK response received interrupt */
#define OTG_HCINT_ACK                 (1 << 5)  /* Bit 5: ACK response received/transmitted interrupt */
#define OTG_HCINT_NYET                (1 << 6)  /* Bit 6: Response received interrupt */
#define OTG_HCINT_TXERR               (1 << 7)  /* Bit 7: Transaction error */
#define OTG_HCINT_BBERR               (1 << 8)  /* Bit 8: Babble error */
#define OTG_HCINT_FRMOR               (1 << 9)  /* Bit 9: Frame overrun */
#define OTG_HCINT_DTERR               (1 << 10) /* Bit 10: Data toggle error */
                                                /* Bits 11-31: Reserved */

/* Host channel-n interrupt register */

#define OTG_HCTSIZ_XFRSIZ_SHIFT       (0)       /* Bits 0-18: Transfer size */
#define OTG_HCTSIZ_XFRSIZ_MASK        (0x7ffff << OTG_HCTSIZ_XFRSIZ_SHIFT)
#define OTG_HCTSIZ_PKTCNT_SHIFT       (19)      /* Bits 19-28: Packet count */
#define OTG_HCTSIZ_PKTCNT_MASK        (0x3ff << OTG_HCTSIZ_PKTCNT_SHIFT)
#define OTG_HCTSIZ_DPID_SHIFT         (29)      /* Bits 29-30: Data PID */
#define OTG_HCTSIZ_DPID_MASK          (3 << OTG_HCTSIZ_DPID_SHIFT)
#  define OTG_HCTSIZ_DPID_DATA0       (0 << OTG_HCTSIZ_DPID_SHIFT)
#  define OTG_HCTSIZ_DPID_DATA2       (1 << OTG_HCTSIZ_DPID_SHIFT)
#  define OTG_HCTSIZ_DPID_DATA1       (2 << OTG_HCTSIZ_DPID_SHIFT)
#  define OTG_HCTSIZ_DPID_MDATA       (3 << OTG_HCTSIZ_DPID_SHIFT) /* Non-control */
#  define OTG_HCTSIZ_PID_SETUP        (3 << OTG_HCTSIZ_DPID_SHIFT) /* Control */
                                                                   /* Bit 31: Reserved */

/* Device configuration register */

#define OTG_DCFG_DSPD_SHIFT           (0)                         /* Bits 0-1: Device speed */
#define OTG_DCFG_DSPD_MASK            (3 << OTG_DCFG_DSPD_SHIFT)
#  define OTG_DCFG_DSPD_HS            (0 << OTG_DCFG_DSPD_SHIFT)  /* High speed */
#  define OTG_DCFG_DSPD_FSHS          (1 << OTG_DCFG_DSPD_SHIFT)  /* Full speed using HS */
#  define OTG_DCFG_DSPD_FS            (3 << OTG_DCFG_DSPD_SHIFT)  /* Full speed using internal FS PHY */
#define OTG_DCFG_NZLSOHSK             (1 << 2)                    /* Bit 2:  Non-zero-length status OUT handshake */
                                                                  /* Bit 3:  Reserved */
#define OTG_DCFG_DAD_SHIFT            (4)                         /* Bits 4-10: Device address */
#define OTG_DCFG_DAD_MASK             (0x7f << OTG_DCFG_DAD_SHIFT)
#define OTG_DCFG_PFIVL_SHIFT          (11)                        /* Bits 11-12: Periodic frame interval */
#define OTG_DCFG_PFIVL_MASK           (3 << OTG_DCFG_PFIVL_SHIFT)
#  define OTG_DCFG_PFIVL_80PCT        (0 << OTG_DCFG_PFIVL_SHIFT) /* 80% of the frame interval */
#  define OTG_DCFG_PFIVL_85PCT        (1 << OTG_DCFG_PFIVL_SHIFT) /* 85% of the frame interval */
#  define OTG_DCFG_PFIVL_90PCT        (2 << OTG_DCFG_PFIVL_SHIFT) /* 90% of the frame interval */
#  define OTG_DCFG_PFIVL_95PCT        (3 << OTG_DCFG_PFIVL_SHIFT) /* 95% of the frame interval */
                                                                  /* Bit 13: Reserved */
#define OTG_DCFG_XCVRDLY              (1 << 14)                   /* Bit 14: Transceiver delay */
#define OTG_DCFG_ERRATIMY             (1 << 15)                   /* Bit 15: Erratic error interrupt mask */
                                                                  /* Bits 16-23: Reserved */
#define OTG_DCFG_PERSCHIVL_SHIFT      (24)                        /* Bits 24-25: Periodic schedule interval */
#define OTG_DCFG_PERSCHIVL_MASK       (3 << OTG_DCFG_PERSCHIVL_SHIFT)
                                                                  /* Bits 26-31: Reserved */

/* Device control register */

#define OTG_TESTMODE_DISABLED         (0)                        /* Test mode disabled */
#define OTG_TESTMODE_J                (1)                        /* Test_J mode */
#define OTG_TESTMODE_K                (2)                        /* Test_K mode */
#define OTG_TESTMODE_SE0_NAK          (3)                        /* Test_SE0_NAK mode */
#define OTG_TESTMODE_PACKET           (4)                        /* Test_Packet mode */
#define OTG_TESTMODE_FORCE            (5)                        /* Test_Force_Enable */

#define OTG_DCTL_RWUSIG               (1 << 0)                   /* Bit 0:  Remote wakeup signaling */
#define OTG_DCTL_SDIS                 (1 << 1)                   /* Bit 1:  Soft disconnect */
#define OTG_DCTL_GINSTS               (1 << 2)                   /* Bit 2:  Global IN NAK status */
#define OTG_DCTL_GONSTS               (1 << 3)                   /* Bit 3:  Global OUT NAK status */
#define OTG_DCTL_TCTL_SHIFT           (4)                        /* Bits 4-6: Test control */
#define OTG_DCTL_TCTL_MASK            (7 << OTG_DCTL_TCTL_SHIFT)
#  define OTG_DCTL_TCTL_DISABLED      (0 << OTG_DCTL_TCTL_SHIFT) /* Test mode disabled */
#  define OTG_DCTL_TCTL_J             (1 << OTG_DCTL_TCTL_SHIFT) /* Test_J mode */
#  define OTG_DCTL_TCTL_K             (2 << OTG_DCTL_TCTL_SHIFT) /* Test_K mode */
#  define OTG_DCTL_TCTL_SE0_NAK       (3 << OTG_DCTL_TCTL_SHIFT) /* Test_SE0_NAK mode */
#  define OTG_DCTL_TCTL_PACKET        (4 << OTG_DCTL_TCTL_SHIFT) /* Test_Packet mode */
#  define OTG_DCTL_TCTL_FORCE         (5 << OTG_DCTL_TCTL_SHIFT) /* Test_Force_Enable */
#define OTG_DCTL_SGINAK               (1 << 7)                   /* Bit 7:  Set global IN NAK */
#define OTG_DCTL_CGINAK               (1 << 8)                   /* Bit 8:  Clear global IN NAK */
#define OTG_DCTL_SGONAK               (1 << 9)                   /* Bit 9:  Set global OUT NAK */
#define OTG_DCTL_CGONAK               (1 << 10)                  /* Bit 10: Clear global OUT NAK */
#define OTG_DCTL_POPRGDNE             (1 << 11)                  /* Bit 11: Power-on programming done */
                                                                 /* Bits 12-17: Reserved */
#define OTG_DCTL_DSBESLRJCT           (1 << 18)                  /* Bit 18: Deep sleep BESL reject */
                                                                 /* Bits 19-31: Reserved */

/* Device status register */

#define OTG_DSTS_SUSPSTS              (1 << 0)                     /* Bit 0: Suspend status */
#define OTG_DSTS_ENUMSPD_SHIFT        (1)                          /* Bits 1-2: Enumerated speed */
#define OTG_DSTS_ENUMSPD_MASK         (3 << OTG_DSTS_ENUMSPD_SHIFT)
#  define OTG_DSTS_ENUMSPD_HS         (0 << OTG_DSTS_ENUMSPD_SHIFT)
#  define OTG_DSTS_ENUMSPD_FSHS       (1 << OTG_DSTS_ENUMSPD_SHIFT)
#  define OTG_DSTS_ENUMSPD_FS         (3 << OTG_DSTS_ENUMSPD_SHIFT)
#define OTG_DSTS_EERR                 (1 << 3)                     /* Bit 3: Erratic error */
#define OTG_DSTS_SOFFN_SHIFT          (8)                          /* Bits 8-21: Frame number of the received SOF */
#define OTG_DSTS_SOFFN_MASK           (0x3fff << OTG_DSTS_SOFFN_SHIFT)
#define OTG_DSTS_SOFFN0               (1 << 8)                     /* Bits 8: Frame number even/odd bit */
#define OTG_DSTS_SOFFN_EVEN           0
#define OTG_DSTS_SOFFN_ODD            OTG_DSTS_SOFFN0
                                                                   /* Bits 23-31: Reserved */
#define OTG_DSTS_DEVLNSTS_SHIFT       (22)                         /* Bits 22-23: Device line status */
#define OTG_DSTS_DEVLNSTS_MASK        (3 << OTG_DSTS_DEVLNSTS_SHIFT)
#  define OTG_DSTS_DEVLNSTS_DP        (1 << OTG_DSTS_DEVLNSTS_SHIFT)
#  define OTG_DSTS_DEVLNSTS_DM        (2 << OTG_DSTS_DEVLNSTS_SHIFT)
                                                                   /* Bits 24-31: Reserved */

/* Device IN endpoint common interrupt mask register */

#define OTG_DIEPMSK_XFRCM             (1 << 0)  /* Bit 0: Transfer completed interrupt mask */
#define OTG_DIEPMSK_EPDM              (1 << 1)  /* Bit 1: Endpoint disabled interrupt mask */
#define OTG_DIEPMSK_AHBERR            (1 << 2)  /* Bit 2: AHB error */
#define OTG_DIEPMSK_TOM               (1 << 3)  /* Bit 3: Timeout condition mask (Non-isochronous endpoints) */
#define OTG_DIEPMSK_ITTXFEMSK         (1 << 4)  /* Bit 4: IN token received when TxFIFO empty mask */
#define OTG_DIEPMSK_INEPNMM           (1 << 5)  /* Bit 5: IN token received with EP mismatch mask */
#define OTG_DIEPMSK_INEPNEM           (1 << 6)  /* Bit 6: IN endpoint NAK effective mask */
                                                /* Bit 7: Reserved */
#define OTG_DIEPMSK_TXFURM            (1 << 8)  /* Bit 8: FIFO underrun mask */
                                                /* Bits 9-12: Reserved */
#define OTG_DIEPMSK_NAKM              (1 << 13) /* Bit 13: NAK interrupt mask */
                                                /* Bits 14-31: Reserved */

/* Device OUT endpoint common interrupt mask register */

